# 6장 데이터 로딩, 저장, 파일형식
## 데이터베이스와 함께 사용하기

In [19]:
import sqlite3
import pandas as pd

- *SQLite는 별도의 DB 서버가 필요없이 DB 파일에 기초하여 데이타베이스 처리를 구현한 Embedded SQL DB 엔진이다. *

In [2]:
query = """
Create table test
(a varchar(20), b varchar(20),
c REAL, d integer); """

In [5]:
con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [6]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = 'Insert into test values (?, ?, ?, ?)'

con. executemany(stmt, data)
con.commit()

- 이상 sqlite3 사용을 위한 기본 세팅

In [11]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [12]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [14]:
list(zip(*cursor.description))[0]

('a', 'b', 'c', 'd')

In [18]:
pd.DataFrame(rows, columns = list(zip(*cursor.description))[0])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

- pandas 모듈의 read_sql함수를 이용하면 간편하게 해결 가능

In [20]:
import pandas.io.sql as sql

In [21]:
pd.read_sql('select * from test', con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5